{
  "backend/main.mo": "Minimal Motoko actor with no methods.",
  "feature_evidence.json": "Feature evidence report describing an email update task for the ContactSection component.",
  "frontend-file-summaries.txt": "Lists short summaries of all key frontend components, sections, data files, and utilities.",
  "frontend/index.css": "Global Tailwind setup defining color tokens, CSS variables, and dark mode styles.",
  "frontend/index.html": "HTML entry point configuring meta tags, fonts, and loading the main React script.",
  "frontend/src/App.tsx": "Main React app composing header, sections, and footer for the full site layout.",
  "frontend/src/components/BrandButton.tsx": "Custom button wrapper applying golden theme variants over the base UI Button.",
  "frontend/src/components/sections/BlousePatternsSection.tsx": "Section displaying six blouse pattern cards with images, names, and descriptions.",
  "frontend/src/components/sections/ContactSection.tsx": "A contact form component with validation, submission handling, success state, and UI rendering for user inquiries.",
  "frontend/src/components/sections/GallerySection.tsx": "Displays a filterable, paginated gallery of items with category buttons and a load-more feature.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero section with a headline, call-to-action buttons, and an image, including smooth-scroll navigation.",
  "frontend/src/components/sections/ProcessSection.tsx": "Shows a four-step workflow using cards with icons, titles, and descriptions.",
  "frontend/src/components/sections/ServicesSection.tsx": "Renders a grid of service offerings with icons and descriptions for different tailoring categories.",
  "frontend/src/components/SiteFooter.tsx": "Footer with brand info, navigation links, social icons, and copyright line.",
  "frontend/src/components/SiteHeader.tsx": "Sticky header with logo, desktop and mobile navigation, and smooth scroll behavior.",
  "frontend/src/data/galleryItems.ts": "Exports the GalleryItem interface and a large list of gallery item objects with images, titles, and categories.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor, refetching dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for handling Internet Identity login, loading stored identities, and exposing login status and actions.",
  "frontend/src/hooks/useQueries.ts": "Empty stub file exporting nothing because the backend has no methods.",
  "frontend/src/index.css": "Defines Tailwind base layers and extensive OKLCH color variables for light and dark themes, along with global styles.",
  "frontend/src/lib/utils.ts": "Exports a utility function that merges class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and the Internet Identity provider.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, typography, container settings, animations, and theme tokens tied to CSS variables.",
  "project_state.json": "Project metadata describing the tailoring website’s features, requirements, and current state."
}